app/Http/Controllers/Delivery/DeliveryController.php

select * from `addresses` where `addresses`.`user_id` = 146 and `addresses`.`user_id` is not null and `set_default` = 1 limit 1
---
    private function getBuyerAddress(): Address {
        return Auth::user()->addresses()->where('set_default', 1)->first();