app/Http/Controllers/BlogController.php


        $blogs = $blogs->where('status', 1)->orderBy('created_at', 'desc')->paginate(12);

        $recent_blogs = Blog::where('status', 1)->orderBy('created_at', 'desc')->limit(9)->get();
---
select * from `blogs` where `status` = 1 and `blogs`.`deleted_at` is null order by `created_at` desc limit 9