app/Http/Controllers/HomeController.php

select * from `categories` where `featured` = 1
---
    public function index()
    {
        $featured_categories = Cache::rememberForever('featured_categories', function () {
            return Category::where('featured', 1)->get();
        });