app/Http/Controllers/PurchaseHistoryController.php

select * from `order_details` where `order_details`.`order_id` in (119, 120, 127, 131, 132, 138, 139, 140, 141)
---
    public function download(Request $request)
    {
        $product = Product::findOrFail(decrypt($request->id));
        $downloadable = false;
        foreach (Auth::user()->orders as $key => $order) {
            foreach ($order->orderDetails as $key => $orderDetail) {